NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32BG21/EFR32BG21B020F512IM32.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ACMP1_NS</name>
      <version>0</version>
      <description>ACMP1_NS Registers</description>
      <baseAddress>0x5A00C000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ACMP1</name>
        <value>42</value>
      </interrupt>
      <registers>
        <register>
          <name>IPVERSION</name>
          <description>No Description</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPVERSION</name>
              <description>IP version ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EN</name>
          <description>No Description</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Module enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>No Description</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x00030F07</resetMask>
          <fields>
            <field>
              <name>BIAS</name>
              <description>Bias Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYST</name>
              <description>Hysteresis mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Hysteresis disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYM10MV</name>
                  <description>10mV symmetrical hysteresis</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYM20MV</name>
                  <description>20mV symmetrical hysteresis</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYM30MV</name>
                  <description>30mV symmetrical hysteresis</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POS10MV</name>
                  <description>10mV hysteresis on positive edge transitions</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POS20MV</name>
                  <description>20mV hysteresis on positive edge transitions</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POS30MV</name>
                  <description>30mV hysteresis on positive edge transitions</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEG10MV</name>
                  <description>10mV hysteresis on negative edge transitions</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEG20MV</name>
                  <description>20mV hysteresis on negative edge transitions</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEG30MV</name>
                  <description>30mV hysteresis on negative edge transitions</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPUTRANGE</name>
              <description>Input Range</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Use this setting when the input to the comparator core can be from 0 to AVDD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REDUCED</name>
                  <description>It is recommended to use this setting when the input to the comparator core will always be less than AVDD-0.7V.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACCURACY</name>
              <description>ACMP accuracy mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>ACMP operates in low-accuracy mode but consumes less current.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>ACMP operates in high-accuracy mode but consumes more current.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>No Description</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>NOTRDYVAL</name>
              <description>Not Ready Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>ACMP output is 0 when the ACMP is not ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>ACMP output is 1 when the ACMP is not ready.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIOINV</name>
              <description>Comparator GPIO Output Invert</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTINV</name>
                  <description>The comparator output to GPIO is not inverted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>The comparator output to GPIO is inverted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
